"""
Создайте матрицу размером 3х3 и выведите значения с индексами 1,2 и 3,3
"""
new_matrix = [[11, 12, 13], [14, 15, 16], [17, 18, 19]]
print("Значение в (1,2):", new_matrix[0][1])
print("Значение в (3,3):", new_matrix[2][2])